#+TITLE: Qafny Design and Bookkeeping
#+OPTIONS: toc:nil date:nil
#+bibliography: design.bib
#+cite_export: biblatex

** Point-free Translation of =buildOp2=
#+begin_src haskell
  x <> ("&&" <!> y)
    == (<>) x  ("&&" <!> y)
    == (flip (<>)) ("&&" <!> y) $ x
    == (flip (<>)) (("&&" <!>) y) $ x
    == (flip (<>)) . ("&&" <!>) $ y x 
#+end_src


# ########################################################################### #
#+begin_src sh :exports none
  cp design.bib design.bib.bak
  cat "Exported Items.bib" >> design.bib
  cat "Exported Items.bib" | grep "title"
#+end_src

#+RESULTS:
|   | title = {Views: a way for pattern matching to cohabit with data abstraction},                                      |
|   | shorttitle = {Views},                                                                                              |
|   | booktitle = {Proceedings of the 14th {ACM} {SIGACT}-{SIGPLAN} symposium on {Principles} of programming languages}, |

#+print_bibliography:



